Jackjan4/PhilduinoArduino/hardware/avr/1.0.1/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################


philduino-tiny.name=Philduino Tiny

philduino-tiny.upload.protocol=usb
philduino-tiny.upload.tool=micronucleus
philduino-tiny.upload.maximum_size=6522
philduino-tiny.upload.maximum_data_size=512

philduino-tiny.build.mcu=attiny85
philduino-tiny.build.f_cpu=16000000L
philduino-tiny.build.board=AVR_PHILDUINOTINY
philduino-tiny.build.core=tiny
philduino-tiny.build.variant=tiny

philduino-tiny.upload.wait_for_upload_port = false
philduino-tiny.upload.use_1200bps_touch = false
philduino-tiny.upload.disable_flushing = false


philduino-tiny.bootloader.tool=avrdude
philduino-tiny.bootloader.low_fuses=0xE1
philduino-tiny.bootloader.high_fuses=0xDD
philduino-tiny.bootloader.extended_fuses=0xFE
philduino-tiny.bootloader.file=tiny/t85_default.hex

